# SpotDimensionFloatingPointError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..SpotDimensionFloatingPointError Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Some spot dimensions contain invalid floating-point values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SpotDimensionFloatingPointError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotDimensionFloatingPointError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SpotDimensionFloatingPointError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace